constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    inlet
    {
        type            patch;
        nFaces          112;
        startFace       63740;
    }
    outlet
    {
        type            patch;
        nFaces          90;
        startFace       63852;
    }
    bottom
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          68;
        startFace       63942;
    }
    top
    {
        type            symmetryPlane;
        inGroups        1(symmetryPlane);
        nFaces          340;
        startFace       64010;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          294;
        startFace       64350;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          64192;
        startFace       64644;
    }
)

// ************************************************************************* //
